20210915221421-systemcrafters.org
:PROPERTIES:
:ID:       fa497359-ae3f-494a-b24a-9822eefe67ad
:END:
#+title: System Crafters
* 概要
System Craftersは[[id:1ad8c3d5-97ba-4905-be11-e6f2626127ad][Emacs]]を中心としたテーマを扱うYouTubeコミュニティ。

- YouTube Channel :: https://www.youtube.com/channel/UCAiiOTio8Yu69c3XnR7nQBQ
- 配信者 David Wilson :: https://github.com/daviwil
* Memo
** [[https://www.youtube.com/watch?v=2KdBbEtqpY0][Creating a Scripting Language in 5 Days - Live Coding in C - YouTube]]
[[id:656a0aa4-e5d3-416f-82d5-f909558d0639][C language]]でスクリプト言語を作るライブコーディング。
** [[https://www.youtube.com/watch?v=wqdT0xKMQT8][System Crafters Live! - The Hidden Value of Emacs' Tab Bar - YouTube]]
新しいYouTubeチャンネル、Flux Harmonicの情報。
[[id:1ad8c3d5-97ba-4905-be11-e6f2626127ad][Emacs]]28に追加された機能 Tab Bar。
** [[https://www.youtube.com/watch?v=50Vsh4qw-E4]["Inverse Literate" Emacs Configurations - Hack Sessions - YouTube]]
- configを文書化する。
- outline-modeを使う。
- 文芸的に書いた設定をorg->lispで変換する。
** [[https://www.youtube.com/watch?v=R5cdtSfTpE0][System Crafters Live! - A First Look at Guix Home - YouTube]]
- guix home はユーザレベルでデーモンやインストールをしてくれるプログラム
* Tasks
* Reference
** [[https://www.youtube.com/channel/UCZ4HO8or08HUGUzA0w8Tagw][Flux Harmonic - YouTube]]
もう1つのチャンネル。ライブコーディングが中心。
* Archives
** DONE 5 Org Roam Hacks for Better Productivity in Emacs
CLOSED: [2021-09-30 Thu 00:23]
:LOGBOOK:
CLOCK: [2021-09-15 Wed 22:58]--[2021-09-15 Wed 23:23] =>  0:25
:END:

[[id:815a2c31-7ddb-40ad-bae0-f84e1cfd8de1][Org-roam]]のハック。
- [[https://www.youtube.com/watch?v=CUkuyW6hr18][5 Org Roam Hacks for Better Productivity in Emacs]]
