20210915221421-systemcrafters.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-08-28 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>System Crafters</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Ultra&display=swap" rel="stylesheet"><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">System Crafters</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc177008">概要</a></li>
<li><a href="#orgc6b137f">Memo</a>
<ul>
<li><a href="#org549f6c3">Creating a Scripting Language in 5 Days - Live Coding in C - YouTube</a></li>
<li><a href="#orgef15b00">System Crafters Live! - The Hidden Value of Emacs&rsquo; Tab Bar - YouTube</a></li>
<li><a href="#orga00dd2a">&ldquo;Inverse Literate&rdquo; Emacs Configurations - Hack Sessions - YouTube</a></li>
<li><a href="#org81513ea">System Crafters Live! - A First Look at Guix Home - YouTube</a></li>
</ul>
</li>
<li><a href="#orgee85739">Tasks</a></li>
<li><a href="#orga3344ef">Reference</a>
<ul>
<li><a href="#orgfa10138">Flux Harmonic - YouTube</a></li>
</ul>
</li>
<li><a href="#org815f4be">Archives</a>
<ul>
<li><a href="#orgce94ccb"><span class="done DONE">DONE</span> 5 Org Roam Hacks for Better Productivity in Emacs</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc177008" class="outline-2">
<h2 id="orgc177008"><a href="#orgc177008">概要</a></h2>
<div class="outline-text-2" id="text-orgc177008">
<p>
System Craftersは<a href="20210508234743-emacs.html#ID-1ad8c3d5-97ba-4905-be11-e6f2626127ad">Emacs</a>を中心としたテーマを扱うYouTubeコミュニティ。
</p>

<dl class="org-dl">
<dt>YouTube Channel</dt><dd><a href="https://www.youtube.com/channel/UCAiiOTio8Yu69c3XnR7nQBQ">https://www.youtube.com/channel/UCAiiOTio8Yu69c3XnR7nQBQ</a></dd>
<dt>配信者 David Wilson</dt><dd><a href="https://github.com/daviwil">https://github.com/daviwil</a></dd>
</dl>
</div>
</div>
<div id="outline-container-orgc6b137f" class="outline-2">
<h2 id="orgc6b137f"><a href="#orgc6b137f">Memo</a></h2>
<div class="outline-text-2" id="text-orgc6b137f">
</div>
<div id="outline-container-org549f6c3" class="outline-3">
<h3 id="org549f6c3"><a href="#org549f6c3"><a href="https://www.youtube.com/watch?v=2KdBbEtqpY0">Creating a Scripting Language in 5 Days - Live Coding in C - YouTube</a></a></h3>
<div class="outline-text-3" id="text-org549f6c3">
<p>
<a href="20210911104632-c_language.html#ID-656a0aa4-e5d3-416f-82d5-f909558d0639">C language</a>でスクリプト言語を作るライブコーディング。
</p>
</div>
</div>
<div id="outline-container-orgef15b00" class="outline-3">
<h3 id="orgef15b00"><a href="#orgef15b00"><a href="https://www.youtube.com/watch?v=wqdT0xKMQT8">System Crafters Live! - The Hidden Value of Emacs&rsquo; Tab Bar - YouTube</a></a></h3>
<div class="outline-text-3" id="text-orgef15b00">
<p>
新しいYouTubeチャンネル、Flux Harmonicの情報。
<a href="20210508234743-emacs.html#ID-1ad8c3d5-97ba-4905-be11-e6f2626127ad">Emacs</a>28に追加された機能 Tab Bar。
</p>
</div>
</div>
<div id="outline-container-orga00dd2a" class="outline-3">
<h3 id="orga00dd2a"><a href="#orga00dd2a"><a href="https://www.youtube.com/watch?v=50Vsh4qw-E4">&ldquo;Inverse Literate&rdquo; Emacs Configurations - Hack Sessions - YouTube</a></a></h3>
<div class="outline-text-3" id="text-orga00dd2a">
<ul class="org-ul">
<li>configを文書化する。</li>
<li>outline-modeを使う。</li>
<li>文芸的に書いた設定をorg-&gt;lispで変換する。</li>
</ul>
</div>
</div>
<div id="outline-container-org81513ea" class="outline-3">
<h3 id="org81513ea"><a href="#org81513ea"><a href="https://www.youtube.com/watch?v=R5cdtSfTpE0">System Crafters Live! - A First Look at Guix Home - YouTube</a></a></h3>
<div class="outline-text-3" id="text-org81513ea">
<ul class="org-ul">
<li>guix home はユーザレベルでデーモンやインストールをしてくれるプログラム</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgee85739" class="outline-2">
<h2 id="orgee85739"><a href="#orgee85739">Tasks</a></h2>
</div>
<div id="outline-container-orga3344ef" class="outline-2">
<h2 id="orga3344ef"><a href="#orga3344ef">Reference</a></h2>
<div class="outline-text-2" id="text-orga3344ef">
</div>
<div id="outline-container-orgfa10138" class="outline-3">
<h3 id="orgfa10138"><a href="#orgfa10138"><a href="https://www.youtube.com/channel/UCZ4HO8or08HUGUzA0w8Tagw">Flux Harmonic - YouTube</a></a></h3>
<div class="outline-text-3" id="text-orgfa10138">
<p>
もう1つのチャンネル。ライブコーディングが中心。
</p>
</div>
</div>
</div>
<div id="outline-container-org815f4be" class="outline-2">
<h2 id="org815f4be"><a href="#org815f4be">Archives</a></h2>
<div class="outline-text-2" id="text-org815f4be">
</div>
<div id="outline-container-orgce94ccb" class="outline-3">
<h3 id="orgce94ccb"><a href="#orgce94ccb"><span class="done DONE">DONE</span> 5 Org Roam Hacks for Better Productivity in Emacs</a></h3>
<div class="outline-text-3" id="text-orgce94ccb">
<p>
<a href="20210508233810-org_roam.html#ID-815a2c31-7ddb-40ad-bae0-f84e1cfd8de1">Org-roam</a>のハック。
</p>
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=CUkuyW6hr18">5 Org Roam Hacks for Better Productivity in Emacs</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
